# Level 100:
# 1.შექმენი თამაში სადაც მომხმარებელი აჭერს start ღილაკს და ეკრანზე ჩნდება ტექსტი "Get Ready...", გარკვეული დროის შემდეგ ჩნდება "GO!" და მომხმარებელმა უნდა დააჭიროს ღილაკს რაც შეიძლება სწრაფად, ბოლოს გამოიტანე რეაქციის დრო

# 2.შექმენი თამაში სადაც ღილაკზე დაჭერის შემდეგ ეკრანზე ჩნდება სხვადასხვა ადგილას წრე, კვადრატი, სამკუთხედი მონაცვლეობით, მომხმარებელმა უნდა დააჭიროს რაც შეიძლება სწრაფად ნებისმიერ ობიექტს, დააჭერის შემდეგ გამოიტანე საშუალო დრო

# 3.შექმენი თამაში სადაც მომხმარებელს აქვს 4 წამი და ამ დროში ეკრანზე ჩნდება random ადგილას პატარა ღილაკი, მომხმარებელმა უნდა დააჭიროს რაც შეიძლება ბევრჯერ, ბოლოს გამოიტანე მაქსიმალური დაჭერის რაოდენობა

# 4.შექმენი თამაში სადაც ღილაკზე დაჭერის შემდეგ 4 ბლოკი ანათებს რიგრიგობით, შემდეგ კი ერთ-ერთი ბლოკი რჩება განათებული შემთხვევით, მომხმარებელმა უნდა დააჭიროს სწორ ბლოკს და გამოიტანე არის თუ არა სწორი და რამდენი დრო დაჭირდა

# 5.შექმენი თამაში სადაც მომხმარებელი თამაშობს 4 რაუნდს, ყოველ რაუნდში ჩნდება განსხვავებული ფერის ობიექტი სხვადასხვა დროს, მომხმარებელმა უნდა დააჭიროს რაც შეიძლება სწრაფად, ბოლოს გამოიტანე:
# ყველა დრო
# საუკეთესო დრო
# საშუალო დრო
