//7)  შექმენი 2 ცვლადი, სადაც მომხმარებელს შემოატანინებ რიცხვებს. შეამოწმე რომელი რიცხვია დადებითი და რომელი უარყოფითი (გამოიტანეთ console.log()-ით)



const num1 = Number(prompt("შეიყვანეთ პირველი რიცხვი:"));


if (num1 > 0){
    console.log('ეს რიცხვი დადებითია')
} else if (num1 < 0){
    console.log('ეს რიცხვი უარყოფითია')
} else {
    console.log('ეს რიცხვი ნულის ტოლია')
}


const num2 = Number(prompt("შეიყვანეთ მეორე რიცხვი:"));


if (num2 > 0){
    console.log('ეს რიცხვი დადებითია')
} else if (num2 < 0){
    console.log('ეს რიცხვი უარყოფითია')
} else {
    console.log('ეს რიცხვი ნულის ტოლია')
}