// level 56:
// 1) კომენტარების სახით ახსენით რა არის ფუნქცია და რისთვის გამოიყენება.
// 2) კომენტარების სახით ახსენით რა განსხვავებაა პითონის ფუნქციასა და ჯავასკრიპტის ფუნქციას შორის?
// 3) შექმენით ჯავასკრიპტის ფუნქცია რომელიც გადაეცემა name, და შენი პროგრამა ესალმება ამ name-ს
// 4) შექმენით ფუნქცია რომელიც გადაეცემა 4 რიცხვი და შენი პროგრამა დააბრუნებს ამ რიცხვების ჯამს
// 5) ახსენი რა განსხვავებაა ჩვეულებრივ ფუნქციასა და arrow function-ს შორის.
// 6) შექმენი arrow function რომელსაც გადეცემა რიცხვი და გაიგებ ეს რიცხვი ლუწია თუ კენტი
// 7) შექმენი  arrow function სახელად countLetters, რომელსაც გადაეცემა სტრინგი და დააბრუნებს რამდენი ასოა სტრიქონში.


// 1) ფუნქცია არის კოდის ბლოკი, რომლის გამოძახებაც შეგვიძლია იმდენჯერ, რამდენჯერაც გვინდა და იგი გამოიყენება კოდის ორგანიზებისთვის და ერთი და იგივე კოდის თავისგან ასაცილებლად

// 2) პითონისა და ჯავა სკრიპტის ფუნქციებს შორის აერის განსხვავება სინტაქსი

// 3)

function username(name) {
    console.log('hallo ' + name)
}
username('luka')


// 4)

function numbers(num1,num2,num3,num4) {
    console.log(num1 + num2 + num3 + num4)
}

numbers(5,10,15,20)

// 5) arrow function-იწერება უფრო მოკლედ და გამოიყენება პატარა თასქებისთვის და ასევე arrow function-ი არის უფრო თანამედროვე

// 6)

function nums(num) {
    if (num %2 === 0){
        console.log('ლუწია')
    } else{
        console.log('კენტია')
    }
}

nums(30)

// 7)

let word = (n) => console.log(n.length)
word('luka')