print("უპასუხე კითხვებს ქულების დაგროვებისათვის, ყოველი სწორი პასუხი +1 ქულას უდრის. არასწორი პასუხის არჩევის შემთხვევაში, მომხმარებელს ქულა არ მოემატება")
print("არის 20 კითხვა და გაქვს 5 სიცოცხლე (ანუ არასწორად პასუხის გაცემის უპლება გაქვს მხოლოდ 5-ჯერ)")
redo = True
while redo:
    points = 0
    lives = 5
    print("")
    print("პირველი ტური:")
    #1
    q1 = input("N1. როდის იყო დიდგორის ბრძოლა?: ")
    if q1 == "1121":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

    
    print(" ")
    #2   
    q2 = input("N2. რა ინდექსი აქვს ლისტის პირველ ელემენტს?: ")
    if q2 == "0":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

     
    
    print(" ")
    #3  
    q3 = input("N3. როგორ იწერება კომენტარი js-ში?: ")
    if q3 == "//":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

    if lives >= 4 and q3 =="#":
        print(" ")
        print("კარგად ართმევ თავს!")
    elif q3 != "#" and lives >= 4:
        print("არაუშავს, კიდე შანსი გაქვს!")
    elif lives < 4:
        print(" ")
        print("ფრთხილად იყავი, ცოტა სიცოცხლე დაგრჩა!")

    print(" ")
    #4
    print("1. <-- -->")
    print("2. <!-- -->")
    print("3. <-- /-->")
    q4 = input("N4. როგორ იწერება კომენტარი html-ში?(აირჩიეთ 1/2/3): ")
    if q4 == "2":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

     

    print(" ")
    #5
    q5 = input("N5. რას ვეძახით html-ს css-ს და js-ს?: ")
    if q5 ==  "ხერხემალი კანი და ტვინი" :
        points+=1
        print("სწორი პასუხია, შენ გადახვედი მე-2 ტურში")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

    if lives == 0:
        print("ამოგეწურა სიცოცხლეები, ცადე თავიდან.")
        break

    print(" ")
    #6  
    q6 = input("N6. რაში გვეხმარება css-ი ?: ")
    if q6 == "გასტილვაში", "დიზაინში":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

    if lives == 0:
        print("ამოგეწურა სიცოცხლეები, ცადე თავიდან.")
        break

    if lives >= 4 and q6 == "7":
        print(" ")
        print("ასე გააგრძელე!")
    elif q6 != "7" and lives >= 4:
        print("არაუშავს, კიდე შანსი გაქვს!")
    elif lives < 4:
        print(" ")
        print("ფრთხილად იყავი, ცოტა სიცოცხლე დაგრჩა!")


    print(" ")
    #7  
    q7 = input("N7. რა საზომი ერთეულები ვიცით css-ში ?: ")
    if q7 == "px,vh,vw,%,rem,em":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

    if lives == 0:
        print("ამოგეწურა სიცოცხლეები, ცადე თავიდან.")
        break

    print(" ")
    #8  
    q8 = input("N8. რას ვიყენებთ js-ში კონსოლში გამოსატანად ?: ")
    if q8 == "console.log":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

    if lives == 0:
        print("ამოგეწურა სიცოცხლეები, ცადე თავიდან.")
        break

    print(" ")
    #9 
    q9 = input("N9. რა ცვლადის შემოტანის სახეები ვიცით js-ში?: ")
    if q9 == "let const var":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

    if lives == 0:
        print("ამოგეწურა სიცოცხლეები, ცადე თავიდან.")
        break

    if lives >= 4 and q9 == "1945":
        print(" ")
        print("ბრავო!")
    elif q9 != "1945" and lives >= 4:
        print("არაუშავს, კიდე შანსი გაქვს!")
    elif lives < 4:
        print(" ")
        print("ფრთხილად იყავი, ცოტა სიცოცხლე დაგრჩა!")


    print(" ")
    #10  
    q10 = input("N10. ვის ცხრილს ვიყენებთ ქიმიაში?")
    if q10 == "მენდელევის","მენდელეევის":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

        
    if lives == 0:
        print("ამოგეწურა სიცოცხლეები, ცადე თავიდან.")
        break


    print(" ")
    #11
    q11 = input("N11. რას ამბობს ნიუტონის პირველი კანონი ?: ")
    if q11 == "თუ სხეულზე არ მოქმედებს ძალა, მაშინ იგი ინარჩუნებს თავის შიჩქარეს":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

    if lives == 0:
        print("ამოგეწურა სიცოცხლეები, ცადე თავიდან.")
        break

    print(" ")
    #12
    q12 = input("N12. რა იყო 'კონტინენტური ბლოკადის' მიზანი?: ")
    if q12 == "შეეზღუდა მეფისთვის მმართველობა":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

    if lives == 0:
        print("ამოგეწურა სიცოცხლეები, ცადე თავიდან.")
        break

    if lives >= 4 and q12 == "1":
        print(" ")
        print("შესანიშნავია!")
    elif q12 != "1" and lives >= 4:
        print("არაუშავს, კიდე შანსი გაქვს!")
    elif lives < 4:
        print(" ")
        print("ფრთხილად იყავი, ცოტა სიცოცხლე დაგრჩა!")


    print(" ") 
    #13 
    q13 = input("N13. რა სახის ოქსიდები არსებობს ქიმიაში ?: ")
    if q13 == "მჟავა მარილი ფუძე ამფოტერული":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")
    
    if lives == 0:
        print("ამოგეწურა სიცოცხლეები, ცადე თავიდან.")
        break

    print(" ")
    #14  
    q14 = input("N14. რას ნიშნავს აბსოლიტური მინარქია ?: ")
    if q14 == "მეფეს აქვს შეუზღუდავი ძალაუფლება":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")
    
    if lives == 0:
        print("ამოგეწურა სიცოცხლეები, ცადე თავიდან.")
        break

    print(" ")
    #15
    q15 = input("N15. რა არის ქართულ ენაში სინტაქსი?")
    if q15 == "სინტაქსი განიხილავს ენაში არსებულ წინადადების ტიპებს. არკვევს რა და რა სახის სიტყვები შეიძლება შეერწყმას ერთმანეთს, რა ურთიერთობა შეიძლება დამყარდეს მათ შორის და რა ნიშვნელობა აქვს წინადადების ამა ტუ იმ წავრს":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

    if lives == 0:
        print("ამოგეწურა სიცოცხლეები, ცადე თავიდან.")
        break

    if lives >= 4 and q15 == "2":
        print(" ")
        print("ყოჩაღ!")
    elif q15 != "2" and lives >= 4:
        print("არაუშავს, კიდე შანსი გაქვს!")
    elif lives < 4:
        print(" ")
        print("ფრთხილად იყავი, ცოტა სიცოცხლე დაგრჩა!")

    print(" ")
    #16
    q16 = input("N16. რა არის ეგვიპტის დედაქალაქი?: ") 
    if q16 == "კაირო":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")
    
    if lives == 0:
        print("ამოგეწურა სიცოცხლეები, ცადე თავიდან.")
        break

    print(" ")
    #17
    print("1. 82")
    print("2. 87")
    print("3. 94")
    print("4. 97")
    q17 = input("N17. რამდენი მთვარე აქვს იუპიტერს?(1/2/3/4): ")
    if q17 == "4":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

    if lives == 0:
        print("ამოგეწურა სიცოცხლეები, ცადე თავიდან.")
        break
    
    if lives >= 4 and q17 == "4":
        print(" ")
        print("დაუჯერებელია!")
    elif q17 != "4" and lives >= 4:
        print("არაუშავს, კიდე შანსი გაქვს!")
    elif lives < 4:
        print(" ")
        print("ფრთხილად იყავი, ცოტა სიცოცხლე დაგრჩა!")


    print(" ")
    #18
    print("1. იენი(Yen)")
    print("2. იუანი(Yuan)")
    print("3. ვონი(Won)")
    print("4. თენგე(Tenge)")
    q18 = input("N18. რომელია ჩინეთის ვალუტა?(1/2/3/4): ")
    if q18 == "2":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

    if lives == 0:
        print("ამოგეწურა სიცოცხლეები, ცადე თავიდან.")
        break

    print(" ")
    #19
    q19 = input("N19. რა ფორმულა აქვს წყალს?: ")
    if q19 == "H2O":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

    if lives == 0:
        print("ამოგეწურა სიცოცხლეები, ცადე თავიდან.")
        break

    print(" ")
    #20
    print("1. მიხეილ სააკაშვილი")
    print("2. ედუარდ შევარდნაძე")
    print("3. ზვიად გამსახურდია")
    print("4. სალომე ზურაბიშვილი")
    q20 = input("N20. ვინ იყო საქართველოს პირველი პრეზიდენტი?(1/2/3/4): ")
    if q20 == "3":
        points+=1
        print("სწორი პასუხია")
        print(f" დარჩენილი სიცოცხლე: { lives}")
    else:
        print("არასწორია") 
        lives -= 1
        print(f" დარჩენილი სიცოცხლე: { lives}")

    if lives == 0:
        print("ამოგეწურა სიცოცხლეები, ცადე თავიდან.")
        break
    else:
        print(f"თქვენ წარმაატებულად დაასრულეთ ქვიზი და მხოლოდ {5-lives} შეცდომა გქონდათ. თქვენი საბოლოო ქულაა {points}. ყოჩაღ!")