import time
import random

a = random.randint(2, 30)
b = random.randint(2,30)
c = random.randint(2,6)
d = random.randint(2,4)

questions = ['რამდენია ' + str(a) + '+ ' + str(b) + '?: ', 
             'რამდენია ' + str(a) + '- ' + str(b) + '?: ', 
             'რა ინდექსი აქვს ლისტის პირველ ელემენტს?: ', 
             'როგორ იწერება კომენტარი js-ში რამდენიმე ხაზზე?: ', 
             'რომელ საზომ ერთეულს ვიყენებთ CSS-ში, რომლის ზომა მომხმარებლის ეკრანის ზომაზეა დამოკიდებული?: ', 
             'რამდენია ' + str(c) + '* ' + str(d) + '?: ', 
             'რამდენია ' + str(c) + '** ' + str(d) + '?: ', 
             'როდის იყო დიდგორის ბრძოლა?: ', 
             'როგორ იწერება მეთანის ქიმიური ფორმულა?: ', 
             'ვის ცხრილს ვიყენებთ ქიმიაში?: ', 
             'რა ჰქვია ნადირობის ქალღმერთს ქართულ მითოლოგიაში?: ', 
             'ადამიანის რომელ ორგანოს აქვს რეგენერაციის უნარი: ', 
             'რომელ ქვეყანას გააჩნია ყველაზე ბევრი დროის სარტყელი:',
             'დაასახელე π-ის პირველი 5 რიცხვი (3.x)',
             'რა ჰქვია უდიდესს უდაბნოს?']
answers = [str(a+b), str(a-b), '0', '/**/', 'vh', str(c*d), str(c**d), '1121', 'CH4', 'მენდელეევის', 'დალი', 'ღვიძლი', 'საფრანგეთი', 3.1415, 'ანტარქტიდა' ]


def quiz(questions, answers):
    score = 0
    print("გილოცავ!!! შენ მოხვდი ალექსისა და ლუკას ქვიზზე. გამოიყენე ეს შესაძლებლობა და შეამოწმე თავი.\nგაეცანი პირობებს: უნდა გასცე 15 კითხვას პასუხი, სწორი პასუხისას შენს ანგარიშს დაემატება 2 ქულა,\nხოლო არასწორი პასუხის შემთხვევაში ქულის დაკლების რაოდენობა დამოკიდებულია სირთულის დონეზე. შენი სიჩქარე დაფიქსირდება.\nდააჭირე Enter, თუ მზად არ აირჩიო შენი სირთულე.")
    input()
    decision = int(input("აირჩიე სირთულე 1-ადვილი, 2-საშუალო, 3-ძნელი: "))
    კ = "პასუხი სწორია, +2"
    if decision == 1:
        ც = "პასუხი არასწორია, 0 "
        მ = 0
    elif decision == 2:
        ც = "პასუხი არასწორია, -1"
        მ = 1
    elif decision == 3:
        ც = "პასუხი არასწორია, -2"
        მ = 2
    print("წამზომი ჩაირთო!\n")
    start_time = time.time()
    for i in range(15):
        a = input(questions[i])
        if a == answers[i]:
            print(f"{კ} \n")
            score+=2
        else:
            print(ც)
            score -= მ
    end_time = time.time()
    time_needed = end_time - start_time
    print(f" შენი ქულაა {score}/26, რომელიც {round(score/26*100,2)}%-ია")
    print(f"დაგჭირდა {round(time_needed,2)} დრო")

quiz(questions, answers)