elif choice == "3":
    # თუ choice == "3" არის, ეს ნიშნავს რომ იუზერი მინდა წაშლა აირჩია

    if len(tasks) == 0:
        # თუ tasks სია ცარიელია, ანუ არაფერი არაა შესაშლელი
        print("სასშლელად არაფერი არაა.")
    else:
        # თუ tasks სია ცარიელი არაა, დავბეჭდოთ ყველა ამოცანა თავისი ინდექსით
        for index, t in enumerate(tasks):
            # enumerate გვაძლევს ინდექსს (0,1,2...) და მნიშვნელობას ერთდროულად
            print(f"{index}) {t}")

        # ვკითხავთ იუზერს, რომელი ინდექსის წაშლა უნდა
        delete_index = int(input("რომელი ნომრის წაშლა გინდა? "))

        # ვამოწმებთ: ხომ არ მიუთითა იუზერმა არასწორი ნომერი
        if 0 <= delete_index < len(tasks):
            # pop(index) შლის კონკრეტულ ელემენტს და ასევე აბრუნებს რა წაიშალა
            removed = tasks.pop(delete_index)
            # ვაჩვენებთ რომელ ელემენტი წაიშალა
            print(f"წაიშალა → {removed}")
        else:
            # თუ ნომერი არასწორია (მაგ. -1 ან ბევრად დიდი)
            print("არასწორი ნომერია!")