# 1) მომხმარებელს შემოატანინეთ სიტყვა, თუ ამ სიტყვის სიგრძე არის 5-ზე მეტი, მაშინ გამოვიტანოთ ყველა ასო, პატარა შრიფტით, თუ არადა დიდით.
# მაშინ გამოვიტანოთ ყველა ასო, პატარა შრიფტით, თუ არადა დიდით.

speed_limit = 5
signal_speed = int(input("შეიყვანე სიჩქარის სიგნალი: "))

if signal_speed <= speed_limit:
    print("გავაგრძელოთ გზა")
else:
    user_decision = input("შევიდეთ პარკში? (კი/არა): ")
    if user_decision.lower() == "კი":
        print("შევდივართ პარკში")
    else:
        print("დავიცადოთ...")